const datavectorOne = 
{
    main:
        [
            "Полное название организации",
            "Краткое название организации",
            "ИНН",
            "КПП",
            "ОГРН",
            "ОКПО",
            "Дата государственной регистрации",
            "Юридический адрес",
            "Фактический адрес",
            "Ген. директор (ФИО)",
            "Бухгалтер (ФИО)",
            "телефон",
        ]
    ,
    "Банковские реквизиты":
        [
            "Наименование банка",
            "БИК",
            "Расчетный счёт",
            "Корр. счёт"
        ]
    
};

export {datavectorOne};
